const xzsqoptions = [
  {
    text: "大祥区",
    Code: 430503,
    // 仙人井社区106
    // 西外街社区105
    // 临律门社区104
    // 北正街社区102
    // 遥临巷社区103
    // 向阳街社区101

    children: [
      {
        text: "中心街道",
        code: 80,
        children: [
          {
            text: "中心路社区",
            code: 101
          },
          {
            text: "府门口社区",
            code: 102
          },
          {
            text: "曹婆井社区",
            code: 103
          },
          {
            text: "六岭社区",
            code: 104
          },
          {
            text: "邵府街社区",
            code: 105
          },
          {
            text: "沙井头社区",
            code: 106
          }
        ]
      },
      {
        text: "蔡锷乡",
        code: 82,
        children: [
          {
            text: "蔡锷村",
            code: 101,
            Wg: [
              {
                WGNum: " 网格一01",
                WG_Man: "朱治华",
                Job: "村干部"
              },
              {
                WGNum: " 网格二02",
                WG_Man: "孙纯",
                Job: "村干部"
              },
              {
                WGNum: "网格三03",
                WG_Man: "车永华",
                Job: "村干部"
              },
              {
                WGNum: "网格三04",
                WG_Man: "车乔保",
                Job: "村干部"
              },
              {
                WGNum: "网格三05",
                WG_Man: "李潭",
                Job: "村辅警"
              }
            ]
          },
          {
            text: "金山村",
            code: 102,
            // 网格一01	王小军	村辅警
            // 网格二02	杨艳娥	村干部
            // 网格三03	王伟军	村干部
            // 网格四04	王威富	村干部
            // 网格五05	王远志	村干部
            // 网格六06	彭翠莲	村干部
            // 网格七07	王友华	村干部
            Wg: [
              {
                WGNum: " 网格一01",
                WG_Man: "王小军",
                Job: "村辅警"
              },
              {
                WGNum: " 网格二02",
                WG_Man: "杨艳娥",
                Job: "村干部"
              },
              {
                WGNum: "网格三03",
                WG_Man: "王伟军",
                Job: "村干部"
              },
              {
                WGNum: "网格三04",
                WG_Man: "王威富",
                Job: "村干部"
              },
              {
                WGNum: "网格三05",
                WG_Man: "王远志",
                Job: "村干部"
              },
              {
                WGNum: "网格三06",
                WG_Man: "彭翠莲",
                Job: "村干部"
              },
              {
                WGNum: "网格七07",
                WG_Man: "王友华",
                Job: "村干部"
              }
            ]
          },
          {
            text: "寒婆村",
            code: 103,
            //                     网格一01	杨美林	村干部
            // 网格二02	刘家习	村干部
            // 网格三03	刘方青	村干部
            // 网格四04	马杰	村辅警
            // 网格五05	李萍	村干部
            // 网格六06	张虎	村干部
            // 网格七07	彭国兵	村干部
            Wg: [
              {
                WGNum: " 网格一01",
                WG_Man: "杨美林",
                Job: "村干部"
              },
              {
                WGNum: " 网格二02",
                WG_Man: "刘家习",
                Job: "村干部"
              },
              {
                WGNum: "网格三03",
                WG_Man: "刘方青",
                Job: "村干部"
              },
              {
                WGNum: "网格三04",
                WG_Man: "马杰",
                Job: "村辅警"
              },
              {
                WGNum: "网格三05",
                WG_Man: "李萍",
                Job: "村干部"
              },
              {
                WGNum: "网格三06",
                WG_Man: "张虎",
                Job: "村干部"
              },
              {
                WGNum: "网格七07",
                WG_Man: "彭国兵",
                Job: "村干部"
              }
            ]
          },
          {
            text: "陈桥村",
            code: 104
          },
          {
            text: "新林村",
            code: 105
          },
          {
            text: "罗士村",
            code: 106
          },
          {
            text: "黄草坪村",
            code: 107
          },
          {
            text: "蒋河村",
            code: 108
          },
          {
            text: "山东村",
            code: 109
          }
        ]
      },

      {
        text: "城北街道",
        code: 79,
        children: [
          {
            text: "向阳街社区",
            code: 101
          },
          {
            text: "遥临巷社区",
            code: 102
          },
          {
            text: "北正街社区",
            code: 103
          },
          {
            text: "临律门社区",
            code: 104
          },
          {
            text: "西外街社区",
            code: 105
          },
          {
            text: "仙人井社区",
            code: 106
          }
        ]
      },

      {
        text: "红旗街道",
        code: 81,

        children: [
          {
            text: "大安街社区",
            code: 101
          },
          {
            text: "南正街社区",
            code: 102
          },
          {
            text: "九井湾社区",
            code: 103
          },
          {
            text: "红旗路社区",
            code: 104
          },
          {
            text: "宝庆中路社区",
            code: 105
          }
        ]
      },
      //   檀江街道011	檀江社区101
      // 檀江街道011	六甲社区102
      // 檀江街道011	双江社区103
      // 檀江街道011	双江社区103
      // 檀江街道011	新塘村101
      // 檀江街道011	多田村102
      // 檀江街道011	丰盈村103

      {
        text: "檀江街道",
        code: 72,
        children: [
          {
            text: "檀江社区",
            code: 101
          },
          {
            text: "六甲社区",
            code: 102
          },
          {
            text: "双江社区",
            code: 103
          },
          {
            text: "新塘村",
            code: 104
          },
          {
            text: "多田村",
            code: 105
          },
          {
            text: "丰盈村",
            code: 106
          }
        ]
      },

      // 学院路街道109	马鞍社区101
      // 学院路街道109	学院路社区102
      // 学院路街道109	深塘社区103
      // 学院路街道109	七里坪社区104
      // 学院路街道109	翁家社区105
      // 学院路街道109	梅子社区106
      // 学院路街道109	桂花社区107

      {
        text: "学院路街道",
        code: 73,
        children: [
          {
            text: "马鞍社区",
            code: 101
          },
          {
            text: "学院路社区",
            code: 102
          },
          {
            text: "深塘社区",
            code: 103
          },
          {
            text: "七里坪社区",
            code: 104
          },
          {
            text: "翁家社区",
            code: 105
          },
          {
            text: "梅子社区",
            code: 106
          },
          {
            text: "桂花社区",
            code: 107
          }
        ]
      },

      // 罗市镇 101	罗市社区 101
      // 罗市镇 101	和平村  101
      // 罗市镇 101	砀山村 102
      // 罗市镇 101	狮子村 104
      // 罗市镇 101	苏家村 105
      // 罗市镇 101	面铺村 106
      // 罗市镇 101	希夷村 107
      // 罗市镇 101	禾家村 108
      // 罗市镇 101	划船村 109
      // 罗市镇 101	盘比村 110

      {
        text: "罗市镇",
        code: 70,
        children: [
          {
            text: "罗市社区",
            code: 101
          },
          {
            text: "和平村",
            code: 102
          },
          {
            text: "砀山村",
            code: 103
          },
          {
            text: "狮子村",
            code: 104
          },
          {
            text: "苏家村",
            code: 105
          },
          {
            text: "面铺村",
            code: 106
          },
          {
            text: "希夷村",
            code: 107
          },
          {
            text: "禾家村",
            code: 108
          },
          {
            text: "划船村",
            code: 109
          },
          {
            text: "盘比村",
            code: 110
          }
        ]
      },

      // 板桥乡203	龙头村101
      // 板桥乡203	召佰村102
      // 板桥乡203	立新村103
      // 板桥乡203	蔡家村104
      // 板桥乡203	金桥村105
      // 板桥乡203	板桥村106
      // 板桥乡203	邵水村107
      // 板桥乡203	李家山村108
      // 板桥乡203	横冲村109
      // 板桥乡203	云安村110
      {
        text: "板桥乡",
        code: 83,
        children: [
          {
            text: "龙头村",
            code: 101
          },
          {
            text: "召佰村",
            code: 110
          },

          {
            text: "立新村",
            code: 102
          },
          {
            text: "蔡家村",
            code: 103
          },
          {
            text: "金桥村",
            code: 104
          },
          {
            text: "板桥村",
            code: 105
          },
          {
            text: "邵水村",
            code: 106
          },
          {
            text: "李家山村",
            code: 107
          },
          {
            text: "横冲村",
            code: 108
          },
          {
            text: "云安村",
            code: 109
          }
        ]
      },

      // 城南街道107	清风村101
      // 城南街道107	台上村102
      // 城南街道107	桃花社区107
      // 城南街道107	茅坪社区012
      // 城南街道107	紫霞社区011
      // 城南街道107	湖口井社区010

      {
        text: "城南街道",
        code: 75,
        children: [
          {
            text: "清风村",
            code: 101
          },
          {
            text: "台上村",
            code: 102
          },
          {
            text: "桃花社区",
            code: 103
          },
          {
            text: "茅坪社区",
            code: 104
          },
          {
            text: "紫霞社区",
            code: 105
          },
          {
            text: "湖口井社区",
            code: 106
          }
        ]
      },

      // 城西街道 104	城西社区 101
      // 城西街道 104	西湖社区 102
      // 城西街道 104	二纺机社区 103
      // 城西街道 104	香樟社区 104
      // 城西街道 104	樟树垅社区105
      // 城西街道 104	湘印机社区106

      {
        text: "城西街道",
        code: 78,
        children: [
          {
            text: "城西社区",
            code: 101
          },
          {
            text: "西湖社区",
            code: 102
          },
          {
            text: "二纺机社区",
            code: 103
          },
          {
            text: "香樟社区",
            code: 104
          },
          {
            text: "樟树垅社区",
            code: 105
          },
          {
            text: "湘印机社区",
            code: 106
          }
        ]
      },

      // 翠园街道105	沙子坡社区105
      // 翠园街道105	拦河坝社区101
      // 翠园街道105	翠园社区103
      // 翠园街道105	三八亭社区104
      // 翠园街道105	戴家社区106
      // 翠园街道105	李子园社区102

      {
        text: "翠园街道",
        code: 76,
        children: [
          {
            text: "沙子坡社区",
            code: 101
          },
          {
            text: "拦河坝社区",
            code: 102
          },
          {
            text: "翠园社区",
            code: 103
          },
          {
            text: "三八亭社区",
            code: 104
          },
          {
            text: "戴家社区",
            code: 105
          },
          {
            text: "李子园社区",
            code: 106
          }
        ]
      },

      // 火车南站街道108	红星社区 105
      // 火车南站街道108	祭旗社区106
      // 火车南站街道108	铜铃社区102
      // 火车南站街道108	九十亭社区101
      // 火车南站街道108	板铺社区103
      // 火车南站街道108	桔园社区104

      {
        text: "火车南站街道",
        code: 74,
        children: [
          {
            text: "红星社区",
            code: 101
          },
          {
            text: "祭旗社区",
            code: 102
          },
          {
            text: "铜铃社区",
            code: 103
          },
          {
            text: "九十亭社区",
            code: 104
          },
          {
            text: "板铺社区",
            code: 105
          },
          {
            text: "桔园社区",
            code: 106
          }
        ]
      },

      // 百春园街道106	滑石村社区101
      // 百春园街道106	西城社区102
      // 百春园街道106	百春园社区103
      // 百春园街道106	金桥社区104
      // 百春园街道106	马蹄社区106
      // 百春园街道106	白洲社区107
      // 百春园街道106	神滩社区108

      {
        text: "百春园街道",
        code: 77,
        children: [
          {
            text: "滑石村社区",
            code: 101
          },
          {
            text: "西城社区",
            code: 102
          },
          {
            text: "百春园社区",
            code: 103
          },
          {
            text: "金桥社区",
            code: 104
          },
          {
            text: "马蹄社区",
            code: 105
          },
          {
            text: "白洲社区",
            code: 106
          },
          {
            text: "神滩社区",
            code: 107
          }
        ]
      },
      {
        text: "雨溪街道",
        code: 71,
        children: [
          {
            text: "雨溪社区",
            code: 101
          },
          {
            text: "唐四社区",
            code: 102
          },
          {
            text: "河洲社区",
            code: 103
          },
          {
            text: "新冲村",
            code: 104
          },
          {
            text: "五花村",
            code: 105
          },
          {
            text: "罗塘村",
            code: 106
          },
          {
            text: "小田村",
            code: 107
          }
        ]
      }
    ]
  }
];

export default xzsqoptions;
